# Project: Titanic - machine learning from Disaster

In [2]:
import pandas as pd 
import numpy as np

In [3]:
train_df = pd.read_csv('./titanic/train.csv', index_col = "PassengerId")
test_df = pd.read_csv('./titanic/test.csv', index_col = "PassengerId")

In [4]:
train_df.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
test_df.columns

Index(['Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare',
       'Cabin', 'Embarked'],
      dtype='object')

Notes: 
 - SibSp: # of Siblings / spouses aboard the Titanic
 - Parch: # of parents / children aboard the Titanic
 - Ticket: Ticket number 
 - Cabin: Cabin number

In [6]:
#Preview data
train_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
test_df.tail()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

## 1. Feature Classification: Categorical vs Numerical
- This helps us select the appropriate plots for visualization

Which features are categorical? 

- Categorical Features: nominal, ordinal, ratio, interval
- To classify the samples into sets of similar samples

which features are numerical? 

- Numerical features: discrete, continuous, or timeseries 
- These values change from sample to sample

In [8]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [9]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 418 entries, 892 to 1309
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Name      418 non-null    object
 2   Sex       418 non-null    object
 3   Age       332 non-null    float64
 4   SibSp     418 non-null    int64
 5   Parch     418 non-null    int64
 6   Ticket    418 non-null    object
 7   Fare      417 non-null    float64
 8   Cabin     91 non-null     object
 9   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(5)
memory usage: 35.9+ KB

- Categorical: Survived, sex, Embarked, Pclass (ordinal), SibSp, Parch
- Numerical: (continuous) Age, fare, (discrete)
- Mix types of data: Ticket, Cabin
- Contain Error/typo: Name
- Blank or Null: Cabin > Age > Embarked
- Various data type: String, int, float
According to the data dictionary, we know that if a passenger is marked as 1, he or she survived. Clearly the number 1 or 0 is a flog for the person's survivorship. Yet the data type of the column is int64, which is a numerical type. we can change that with the following command

In [10]:
train_df["Survived"] = train_df["Survived"].astype("category")

In [11]:
train_df["Survived"].dtype

CategoricalDtype(categories=[0, 1], ordered=False, categories_dtype=int64)

In [12]:
train_df.info

<bound method DataFrame.info of             Survived  Pclass  \
PassengerId
1                  0       3
2                  1       1
3                  1       3
4                  1       1
5                  0       3
...              ...     ...
887                0       2
888                1       1
889                0       3
890                1       1
891                0       3

                                                          Name     Sex   Age  \
PassengerId
1                                      Braund, Mr. Owen Harris    male  22.0
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
3                                       Heikkinen, Miss. Laina  female  26.0
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
5                                     Allen, Mr. William Henry    male  35.0
...                                                        ...     ...   ...
887                                      Montvila, Rev. Juozas    male  27.0
888                               Graham, Miss. Margaret Edith  female  19.0
889                   Johnston, Miss. Catherine Helen "Carrie"  female   NaN
890                                      Behr, Mr. Karl Howell    male  26.0
891                                        Dooley, Mr. Patrick    male  32.0

             SibSp  Parch            Ticket     Fare Cabin Embarked
PassengerId
1                1      0         A/5 21171   7.2500   NaN        S
2                1      0          PC 17599  71.2833   C85        C
3                0      0  STON/O2. 3101282   7.9250   NaN        S
4                1      0            113803  53.1000  C123        S
5                0      0            373450   8.0500   NaN        S
...            ...    ...               ...      ...   ...      ...
887              0      0            211536  13.0000   NaN        S
888              0      0            112053  30.0000   B42        S
889              1      2        W./C. 6607  23.4500   NaN        S
890              0      0            111369  30.0000  C148        C
891              0      0            370376   7.7500   NaN        Q

[891 rows x 11 columns]>

In [19]:
features = ["Pclass", "Sex", "SibSp", "Parch", "Embarked"]
def converted_cat(df, features): 
    for feature in features:
        df[feature] = df[feature].astype("category")
converted_cat(train_df, features)
converted_cat(test_df, features)

In [21]:
train_df.info

<bound method DataFrame.info of             Survived Pclass  \
PassengerId
1                  0      3
2                  1      1
3                  1      3
4                  1      1
5                  0      3
...              ...    ...
887                0      2
888                1      1
889                0      3
890                1      1
891                0      3

                                                          Name     Sex   Age  \
PassengerId
1                                      Braund, Mr. Owen Harris    male  22.0
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
3                                       Heikkinen, Miss. Laina  female  26.0
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
5                                     Allen, Mr. William Henry    male  35.0
...                                                        ...     ...   ...
887                                      Montvila, Rev. Juozas    male  27.0
888                               Graham, Miss. Margaret Edith  female  19.0
889                   Johnston, Miss. Catherine Helen "Carrie"  female   NaN
890                                      Behr, Mr. Karl Howell    male  26.0
891                                        Dooley, Mr. Patrick    male  32.0

            SibSp Parch            Ticket     Fare Cabin Embarked
PassengerId
1               1     0         A/5 21171   7.2500   NaN        S
2               1     0          PC 17599  71.2833   C85        C
3               0     0  STON/O2. 3101282   7.9250   NaN        S
4               1     0            113803  53.1000  C123        S
5               0     0            373450   8.0500   NaN        S
...           ...   ...               ...      ...   ...      ...
887             0     0            211536  13.0000   NaN        S
888             0     0            112053  30.0000   B42        S
889             1     2        W./C. 6607  23.4500   NaN        S
890             0     0            111369  30.0000  C148        C
891             0     0            370376   7.7500   NaN        Q

[891 rows x 11 columns]>

### Distribution of Numerical feature values across the samples

In [22]:
train_df.describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

### Distribution of Categorical features

In [23]:
train_df.describe(include=["category"])

        Survived  Pclass   Sex  SibSp  Parch Embarked
count        891     891   891    891    891      889
unique         2       3     2      7      7        3
top            0       3  male      0      0        S
freq         549     491   577    608    678      644